<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;



class RanksSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $names = [
            ['Рядовой', 0, 50], [ 'Ефрейтор', 50, 150 ],
            [ 'Младший сержант', 100, 300],
            ['Сержант', 300, 700], ['Старший сержант', 700, 1500],
            ['Старшина', 1500, 2500],
            ['Прапорщик', 2500, 3500],
            ['Старший прапорщик', 3500, 4500],
            ['Младший лейтенант', 4500, 5500],
            ['Лейтенант', 5500, 6500],
            ['Старший лейтенант', 6500, 7500],
            ['Капитан', 7500, 10500],
            ['Майор', 10500, 13500],
            ['Подполковник', 13500, 16500],
            ['Полковник', 16500, 20500],
            ['Генерал-майор', 20500, 25500],
            ['Адмирал', 25500, 30500],
            ['Адмирал флота', 30500, 1000000]
        ];
        DB::table('ranks')->delete();

        foreach ($names as $rank)
        {
            DB::table('ranks')->insert([
                'name' => $rank[0],
                'from' => $rank[1],
                'to' => $rank[2],
            ]);
        }

    }
}
